{
  "events": [
    {
      "title": "OpenEnv Hackathon",
      "date": "Mar7",
      "location": "San Francisco, CA",
      "url": "https://cerebralvalley.ai/e/openenv-hackathon-sf",
      "description": "The OpenEnv Hackathon will challenge participants with 10 tracks to build RL environments and enhance base model performance, backed by top-tier judges and mentors from Meta, Hugging Face, UC Berkeley, and leading AI organizations, competing for a $100K prize pool."
    },
    {
      "title": "PyTorch Helion Hackathon",
      "date": "Mar14",
      "location": "San Francisco, CA",
      "url": "https://cerebralvalley.ai/e/helion-hackathon",
      "description": "Developers, researchers, and ML engineers will explore cutting-edge GPU kernel development with Helion, PyTorch’s Python-native authoring tool that greatly simplifies high-performance ML kernel creation, alongside a sneak peek at NVIDIA’s CompileIQ for optimized code generation, supported by expert mentorship and hands-on workshops."
    },
    {
      "title": "Nebius.Build SF",
      "date": "Mar15",
      "location": "San Francisco, CA",
      "url": "https://cerebralvalley.ai/e/nebius-build-sf?utm_source=cv-events-featured&utm_medium=cerebralvalley&_bhlid=744877fca55fbfa1c1150146dceac28a10958db8&tab=guest-list",
      "description": "Engineers specializing in autonomous systems and high-performance inference will dive into hands-on sessions optimizing inference workloads and sim-to-real robotics builds, culminating in a hackathon judged by experts with prizes on the line. Mentors with deep technical know-how will be on hand to turbocharge team projects before GTC week."
    },
    {
      "title": "Llama Lounge Agentic Hackathon",
      "date": "Feb27",
      "location": "Menlo Park, CA",
      "url": "https://cerebralvalley.ai/e/llama-lounge-agentic-hackathon?tab=guest-list",
      "description": "Join Llama Lounge’s first-ever hackathon at the Silicon Valley AI Hub on Snowflake’s Menlo Park campus for two days of hands-on building at the frontier of agentic AI. Backed by CrewAI, Composio, Skyfire, Snowflake, and Llama Lounge, you’ll prototype autonomous, collaborative agents that reason, adapt, and take real-world action across modern workflows Theme: Agentic AI. Move beyond static models to dynamic agents that plan, collaborate with humans and other agents, integrate across APIs and data platforms, and deliver measurable outcomes—whether through multi-agent enterprise automation, cloud copilots, or persistent digital assistants. Prizes: Over $9,000 in cash prizes for winning teams Judges & Speakers: Top industry builders and leaders, pitch your project directly to them — to be announced very soon… Note: This event is fully in person in Menlo Park. Space is limited. Maximum team size of four. All attendees must submit an application and be approved."
    },
    {
      "title": "Autonomous Business Hackathon",
      "date": "Mar5",
      "location": "San Francisco, CA",
      "url": "https://cerebralvalley.ai/e/Autonomous-Business-Hackathon",
      "description": "This two-day hackathon will bring together developers and industry experts to build fully autonomous businesses where agents make real economic decisions and operate with minimal human input, showcasing innovative monetizable projects. Attendees will gain insights from leading speakers and judges while competing for exciting prizes."
    },
    {
      "title": "Build with Intent: Leading Engineering in the AI Era with Eric Schmidt",
      "date": "Mar10",
      "location": "San Francisco, CA",
      "url": "https://luma.com/oaf6etsx?utm_source=cv-events-featured&utm_medium=cerebralvalley",
      "description": "Join a curated group of CTOs, VPs of Engineering, and technical leaders at The Battery in San Francisco for an exclusive afternoon with Eric Schmidt. The conversation will go deep on what's actually working in AI-powered development — the automation wins, the new capabilities reshaping how teams build, and how engineering orgs are measuring real impact beyond vibes. Expect lightning talks from engineering leaders who have driven meaningful transformation, followed by happy hour and genuine peer-to-peer connection. Space is limited and approval is required — request your spot now."
    },
    {
      "title": "AI+ Renᴬᴵssance Conference",
      "date": "Mar15",
      "location": "San Francisco, CA",
      "url": "https://luma.com/renaissance26?utm_source=cv-events-featured&utm_medium=cerebralvalley",
      "description": "Renaissance 2026 will gather 40 AI pioneers, including founders, researchers, and engineers, alongside 20+ top startups and 2,000 industry professionals to dive into breakthroughs in Multimodal Intelligence, AI Agents, Infrastructure, and Robotics. This flagship summit spotlights visionaries shaping the future of AI over two intensive days."
    },
    {
      "title": "ZeroClick Dinner for AI Builders & Operators",
      "date": "Mar24",
      "location": "San Francisco, CA",
      "url": "https://luma.com/zeroclick-sf?utm_source=cv-events-featured&utm_medium=cerebralvalley",
      "description": "Leaders shaping agentic AI, including founders, C-suite executives, and product and growth heads, will explore monetization strategies and developer engagement through ZeroClick’s AI-native ad platform during an intimate evening of insightful conversations and dining."
    },
    {
      "title": "OceanTech Hackathon",
      "date": "Feb28",
      "location": "San Francisco, CA",
      "url": "https://luma.com/mi0uv1p6?utm_source=cv-events&utm_medium=cerebralvalley",
      "description": "This one-day hackathon will bring together AI engineers, marine biologists, policy experts, and community members to co-create AI-driven solutions tackling ocean health, coastal resilience, pollution, and restoration challenges, guided by top ocean scientists and real-world maritime constraints."
    },
    {
      "title": "Web Agents Hackathon",
      "date": "Feb28",
      "location": "San Francisco, CA",
      "url": "https://browser-use.com/hackathon?utm_source=cv-events&utm_medium=cerebralvalley",
      "description": "Get ready to build revolutionary web automation projects using cutting-edge AI tools from top tech sponsors like Google DeepMind and Vercel, competing for prizes including a guaranteed YC interview by hacking alongside skilled builders and industry leaders in a fast-paced 24-hour event."
    },
    {
      "title": "Google DeepMind x InstaLILY AI - Office Hackathon Track",
      "date": "Feb28",
      "location": "San Francisco, CA",
      "url": "https://luma.com/lw45p5sw?utm_source=cv-events&utm_medium=cerebralvalley",
      "description": "A hands-on hackathon hosted by InstaLILY AI and Google DeepMind will gather experienced engineers with a proven track record of shipping production code to design and deploy edge native systems, with on-the-spot job offers for winners judged by founding engineers and AI experts from top universities."
    },
    {
      "title": "Mistral Worldwide Hackathon - San Francisco edition",
      "date": "Feb28",
      "location": "San Francisco, CA",
      "url": "https://luma.com/mistralhack-sanfrancisco?utm_source=cv-events&utm_medium=cerebralvalley",
      "description": "The Mistral Worldwide Hackathon will gather over 1,000 top AI engineers across seven global cities, including San Francisco, for an intense 2-day overnight coding marathon backed by industry leaders like NVIDIA, AWS, and Hugging Face. Participants, ranging from solo coders to small teams, will compete for substantial cash prizes, tech credits, and exclusive opportunities such as interviews for the Supercell AI Innovation Lab."
    },
    {
      "title": "bioArena Hackathon: In Silico to In Vitro",
      "date": "Feb28",
      "location": "San Francisco, CA",
      "url": "https://luma.com/a6t92ohv?utm_source=cv-events&utm_medium=cerebralvalley",
      "description": "A second agentic bio hackathon will challenge bench scientists, computational biologists, and engineers to design protein binders targeting TREM2, with top computational candidates undergoing real wet-lab validation and scoring based on experimental binding performance."
    },
    {
      "title": "AI Youth Hackathon with Lovable - 🧠 The AI Collective Tri-Valley Chapter",
      "date": "Feb28",
      "location": "Pleasanton, CA",
      "url": "https://luma.com/aic-tr-2-28?utm_source=cv-events&utm_medium=cerebralvalley",
      "description": "The AI Youth Hackathon – Tri-Valley will give middle and high school students hands-on experience building AI projects using the Lovable platform, with mentorship from industry pros and opportunities for recognition and prizes in impactful tracks like social good and youth well-being. No prior coding skills are needed, making it a great chance to dive into AI creativity and problem-solving."
    },
    {
      "title": "Vibeclauding for Marketers",
      "date": "Feb28",
      "location": "San Francisco, CA",
      "url": "https://luma.com/8kld1yd1?utm_source=cv-events&utm_medium=cerebralvalley",
      "description": "Marketing pros will guide you through building AI agents from scratch—no coding needed—as you create tools for ads, Twitter automation, and SEO content, empowering you to confidently navigate AI-driven marketing."
    },
    {
      "title": "\\[HYSTA TALK\\] 2026 Spring Forward with AI ── AI Application and Market Penetration",
      "date": "Feb28",
      "location": "San Jose, CA",
      "url": "https://luma.com/0xo8b57d?utm_source=cv-events&utm_medium=cerebralvalley",
      "description": "The 2026 Spring Forward with AI event will feature a keynote by Ed Chi, VP of Research at Google DeepMind, and a Deloitte-led innovation panel with industry leaders from Fireworks AI and Genspark.ai, drawing top AI and tech professionals for insightful discussions and networking."
    },
    {
      "title": "The Art of Living: Finding Calm in the AI Age",
      "date": "Mar1",
      "location": "San Francisco, CA",
      "url": "https://luma.com/fajucond?utm_source=cv-events&utm_medium=cerebralvalley",
      "description": "This event will explore how AI startup founders and thought leaders from the Institute of Absolute Intelligence will delve into human consciousness and inner clarity amid technological change, complemented by guided meditation and breathwork from Art of Living instructors. It will also offer a chance to network with professionals shaping fields like AI, marketing, and finance who value inner growth alongside innovation."
    },
    {
      "title": "AI Founder Breakfast",
      "date": "Mar3",
      "location": "San Francisco, CA",
      "url": "https://luma.com/yvbft57y?utm_source=cv-events&utm_medium=cerebralvalley",
      "description": "A curated breakfast event will gather Seed-stage AI and SaaS founders for focused, peer-driven discussions and practical Q&A, fostering authentic connections and ongoing relationships in a relaxed, structured setting."
    },
    {
      "title": "Coding Agents: AI Driven Dev Conference",
      "date": "Mar3",
      "location": "Mountain View, CA",
      "url": "https://luma.com/codingagents?utm_source=cv-events&utm_medium=cerebralvalley",
      "description": "This event will dive deep into the latest programmable abstraction layers in software development, featuring real-world insights from top engineers and founders like Sid Bidasaria, Harrison Chase, and Faye Zhang, tackling the evolving challenges of generative and AI-driven coding."
    },
    {
      "title": "Solving chronic illness with AI — A Founders Roundtable",
      "date": "Mar3",
      "location": "San Francisco, CA",
      "url": "https://luma.com/azw4gtmy?utm_source=cv-events&utm_medium=cerebralvalley",
      "description": "A roundtable will bring together founders, engineers, and builders to explore how AI can create meaningful solutions for chronic conditions like Long COVID, ME/CFS, autoimmunity, and Lyme disease that traditional healthcare overlooks. This discussion will focus on innovative approaches for underserved patient communities."
    },
    {
      "title": "Daytona AI Researchers",
      "date": "Mar3",
      "location": "Stanford, CA",
      "url": "https://luma.com/eswm2omv?utm_source=cv-events&utm_medium=cerebralvalley",
      "description": "This event will bring together AI researchers for insightful talks and collaborative networking, creating a vibrant space to exchange cutting-edge ideas and advance research in artificial intelligence."
    },
    {
      "title": "Consumer AI Accelerator Demo Day",
      "date": "Mar3",
      "location": "San Francisco, CA",
      "url": "https://partiful.com/e/FI2PKEoVqDDPL85Vozgh?utm_source=cv-events&utm_medium=cerebralvalley",
      "description": "The Consumer AI Accelerator will showcase pitches from 32 AI-native startups boasting $50M+ combined ARR, including top founders from NVIDIA, Microsoft, Google, and Stanford, alongside investors from Lightspeed, BITKRAFT, and Microsoft M12. These high-growth startups feature real users and robust revenue, backed by $30M+ raised and a strong mix of bootstrapped and funded companies."
    },
    {
      "title": "Founding Sales Masterclass with Mark Roberge",
      "date": "Mar3",
      "location": "San Francisco, CA",
      "url": "https://luma.com/markroberge?utm_source=cv-events&utm_medium=cerebralvalley",
      "description": "Mark Roberge, former HubSpot CRO and Harvard Business School lecturer with an MBA from MIT Sloan, will lead a masterclass on scaling sales teams using data-driven strategies and inbound methodologies, perfect for founders and sales leaders aiming to build predictable, high-growth revenue engines."
    },
    {
      "title": "How AI-native unicorns scale, with the Co-Founder of Replit, COO of Linear, CPO of Harvey, and Cowboy Ventures",
      "date": "Mar3",
      "location": "San Francisco, CA",
      "url": "https://luma.com/3goscvql?utm_source=cv-events&utm_medium=cerebralvalley",
      "description": "Aileen Lee of Cowboy Ventures will lead a dynamic panel featuring top female leaders like Haya Odeh of Replit, Cristina Cordova of Linear, and Anique Drumright of Harvey discussing how AI is driving innovation and transformation in tech companies."
    },
    {
      "title": "Founder Breakfast",
      "date": "Mar4",
      "location": "San Francisco, CA",
      "url": "https://luma.com/12i5i7yr?utm_source=cv-events&utm_medium=cerebralvalley",
      "description": "A breakfast event exclusively for VC-backed AI founders from Seed to Series B, emphasizing direct, peer-driven conversations and ongoing relationship-building through curated seating and structured discussions. Attendees will be fellow founders who have raised at least $1M, fostering a focused environment for practical Q&A and meaningful networking."
    },
    {
      "title": "Stripe Startups Build Day",
      "date": "Mar4",
      "location": "San Francisco, CA",
      "url": "https://luma.com/43egjo0v?utm_source=cv-events&utm_medium=cerebralvalley",
      "description": "The Stripe founder community will engage in a dynamic Build Day featuring hands-on integration support, 1:1 Stripe strategy consultations, and product demos focused on monetizing AI, marketplace building, and global scaling, alongside a fireside chat with Warp CEO Zach Lloyd. This event will bring together venture-backed founders for coworking, expert guidance, and insights into Stripe’s newest tools."
    },
    {
      "title": "Coffee Club \\| Early Stage B2B Tech Founders & Funders",
      "date": "Mar4",
      "location": "San Francisco, CA",
      "url": "https://luma.com/px8h3jtf?utm_source=cv-events&utm_medium=cerebralvalley",
      "description": "Early-stage B2B and AI founders, especially under-represented groups, will connect with investors from Forum Ventures, a leading early-stage AI and SaaS fund, in an intimate coffee meetup designed for meaningful networking and support."
    },
    {
      "title": "Claude-Mem Pro Launch Party",
      "date": "Mar4",
      "location": "San Francisco, CA",
      "url": "https://luma.com/mwsp6qgz?utm_source=cv-events&utm_medium=cerebralvalley",
      "description": "Alex Newman, creator of the top-ranked, open-source Claude-Mem.ai, will showcase how his revolutionary real-time context management system transforms AI agents with persistent, searchable memory. Expect a live demo, deep insights into the innovative three-layer memory architecture, and an engaging Q&A revealing how this breakthrough is reshaping AI development."
    },
    {
      "title": "n8n Builder Sessions: San Francisco, CA \\[Intermediate level\\]",
      "date": "Mar4",
      "location": "San Francisco, CA",
      "url": "https://luma.com/lzw1fjqt?utm_source=cv-events&utm_medium=cerebralvalley",
      "description": "The n8n Builder Sessions will elevate experienced automation users into skilled automation engineers through hands-on workshops covering advanced workflow design, JSON, webhooks, and error handling, led by experts including Aemal Sayer and Christian Voigt. Attendees with prior n8n knowledge will also benefit from free licenses and networking with fellow professionals over food and drinks."
    },
    {
      "title": "Autonomous Cloud Commitment Management",
      "date": "Mar4",
      "location": "San Francisco, CA",
      "url": "https://luma.com/5pf768xy?utm_source=cv-events&utm_medium=cerebralvalley",
      "description": "A select group of cloud, FinOps, and engineering leaders with top experts from Arlo and nOps will explore how autonomous commitment management drives 40%+ savings through automated rate optimization and scalable cost risk strategies in real production environments. This event features practitioner-led insights, a fireside chat with FinOps leaders like Chris Robertson and Bindu Sharma, and peer discussions on mastering cloud financial operations."
    },
    {
      "title": "Agent Infra Demo Night",
      "date": "Mar4",
      "location": "San Francisco, CA",
      "url": "https://luma.com/mqifx2cp?utm_source=cv-events&utm_medium=cerebralvalley",
      "description": "Founders and developers from top companies like Composio, Braintrust, and Notion will showcase cutting-edge agent system workflows in rapid-fire demos, followed by a curated happy hour for networking among industry leaders including Convex’s Co-founder and CTO James Cowling."
    },
    {
      "title": "From Idea to Impact: Women in AI Panel & Pitch Night - The AI Collective Tri-Valley × Innovate Bay",
      "date": "Mar4",
      "location": "San Jose, CA",
      "url": "https://luma.com/aic-tr-3-4?utm_source=cv-events&utm_medium=cerebralvalley",
      "description": "The AI Collective and Innovate Bay will highlight women founders, VCs, and leaders shaping AI's future through a panel on turning ideas into impactful products, ethical AI, and growth strategies, followed by a showcase of women-led AI startups."
    },
    {
      "title": "AI Engineers: March w/ AWS, ThoughtSpot & Purple AI",
      "date": "Mar4",
      "location": "San Francisco, CA",
      "url": "https://luma.com/uwtpwvj2?utm_source=cv-events&utm_medium=cerebralvalley",
      "description": "The March San Francisco AI Engineers Tech Talk will showcase expert insights from leaders like a ThoughtSpot VP and AWS specialist, diving into real-world AI engineering challenges and solutions among an audience of seasoned developers, data scientists, and AI founders. This event will offer a rare chance to gain deep technical knowledge and network with top AI professionals in a focused, no-fluff setting."
    },
    {
      "title": "AI Engineers: March",
      "date": "Mar4",
      "location": "San Francisco, CA",
      "url": "https://www.meetup.com/san-francisco-ai-engineers/events/312251076/?utm_source=cv-events&utm_medium=cerebralvalley",
      "description": "The March San Francisco AI Engineers Tech Talk will bring together seasoned machine learning engineers and fullstack developers to explore hands-on AI projects, tackle real technical challenges, and exchange practical solutions in a no-nonsense, engineer-focused setting."
    },
    {
      "title": "Fin x Snowflake: Deploying Agentic AI in the Enterprise",
      "date": "Mar4",
      "location": "San Francisco, CA",
      "url": "https://luma.com/FinxSnowflake?utm_source=cv-events&utm_medium=cerebralvalley",
      "description": "Fin and Snowflake will dive into how agentic AI is evolving from pilots to full enterprise integration, highlighting key factors like data reliability, trust, and ROI. Industry leaders like Intercom’s COO and Snowflake’s AI VP will share expert insights on when to build versus buy AI solutions and the shifting demands between customer-facing and internal applications."
    },
    {
      "title": "Startup Pitch & Networking in San Francisco",
      "date": "Mar4",
      "location": "San Francisco, CA",
      "url": "https://luma.com/nx5alkjx?utm_source=cv-events&utm_medium=cerebralvalley",
      "description": "Startup Valley will showcase 4-8 startups pitching live to a room of angel investors, VC partners, and seasoned operators, delivering candid, actionable feedback from top investors and AI experts to help founders sharpen their strategies and foster meaningful connections."
    },
    {
      "title": "Agent Builders Breakfast (SOMA)",
      "date": "Mar5",
      "location": "San Francisco, CA",
      "url": "https://luma.com/aobk3n7g?utm_source=cv-events&utm_medium=cerebralvalley",
      "description": "The Agent Builders Breakfast will bring together experienced Founders, Product Managers, and Engineering leaders actively creating AI agents using tools like Claude Code and Cursor for casual networking and skill-sharing over breakfast tacos and coffee, hosted by Michael Ducker, ex-PM at Mercury, Chime, and Twitter."
    },
    {
      "title": "Founder Breakfast",
      "date": "Mar5",
      "location": "San Francisco, CA",
      "url": "https://luma.com/lw3iwtc9?utm_source=cv-events&utm_medium=cerebralvalley",
      "description": "A selective breakfast event will gather Seed to Series B founders focused on B2B SaaS and AI for structured, peer-driven discussions and Q&A, fostering honest conversations and lasting connections. Attendees will benefit from curated seating and interactive formats designed by experienced community builders and tech-savvy sponsors."
    },
    {
      "title": "Funded Female Founders Summit",
      "date": "Mar5",
      "location": "San Francisco, CA",
      "url": "https://luma.com/FFFSummit2026?coupon=FFF25&utm_source=cv-events&utm_medium=cerebralvalley",
      "description": "The Funded Female Founders Summit will bring together over 200 venture-backed women founders alongside 85+ active VCs, LPs, and ecosystem leaders for in-depth discussions on AI entrepreneurship, early-stage investing, and navigating the full funding journey. Attendees will gain tactical insights and forge meaningful connections aimed at driving real outcomes in the startup and venture capital world."
    },
    {
      "title": "-1 to Elad Gil",
      "date": "Mar5",
      "location": "San Francisco, CA",
      "url": "https://luma.com/eladgilspc?utm_source=cv-events&utm_medium=cerebralvalley",
      "description": "Elad Gil, a seasoned entrepreneur and investor behind over 50 unicorn startups including Airbnb and OpenAI, will lead a fireside chat sharing insights on scaling high-growth tech companies and the future of AI investment."
    },
    {
      "title": "Collective Intelligence ep.2 ~ Live (w/ The AI Collective)",
      "date": "Mar5",
      "location": "San Francisco, CA",
      "url": "https://luma.com/irl_podcast-2?utm_source=cv-events&utm_medium=cerebralvalley",
      "description": "Episode 2 of the Collective Intelligence podcast will feature live, unscripted discussions with top AI leaders like Stefan Weitz, CEO of HumanX, Google’s Web AI Lead Jason Mayes, and W3C protocol creator Alex Nahas, revealing cutting-edge insights on AI deployment, on-device models, and web AI interactions."
    },
    {
      "title": "Storytelling that Moves Markets: Women Healthtech & AI Founders LIVE!",
      "date": "Mar5",
      "location": "San Francisco, CA",
      "url": "https://luma.com/storytelling-that-moves-markets-healthte?utm_source=cv-events&utm_medium=cerebralvalley",
      "description": "Founders, investors, and operators will experience a live storytelling event focusing on crafting narratives that build trust and unlock capital, with insights tailored for Healthtech and AI industries. Attendees will gain practical frameworks and real-world examples to enhance their fundraising, customer pitches, and team alignment."
    },
    {
      "title": "Vercel Demo Night: Designing with AI",
      "date": "Mar5",
      "location": "San Francisco, CA",
      "url": "https://luma.com/h31ppnn6?utm_source=cv-events&utm_medium=cerebralvalley",
      "description": "Design leaders from Atlassian, GitHub, Browserbase, and Yutori will showcase cutting-edge AI-driven design tools and workflows, offering dynamic demos that highlight the future of creative software development."
    },
    {
      "title": "Scaling AI the Cloud Native Way",
      "date": "Mar5",
      "location": "San Francisco, CA",
      "url": "https://luma.com/k96i3afj?utm_source=cv-events&utm_medium=cerebralvalley",
      "description": "Open source experts and cloud infrastructure pros will dig into cutting-edge AI, GenAI app data platforms, zero-CVE Kubernetes automation, and unified hybrid private cloud architecture, featuring hands-on demos and enterprise-grade insights from Nutanix, RapidFort, and PingCAP engineers."
    },
    {
      "title": "IWD Build Night with Lovable and AI Snack Club",
      "date": "Mar5",
      "location": "San Francisco, CA",
      "url": "https://luma.com/ft597gca?utm_source=cv-events&utm_medium=cerebralvalley",
      "description": "An International Women's Day mini hackathon will empower women professionals to build practical AI solutions they wish they had during challenging times, gaining hands-on experience with AI tools and creating projects without any coding required. This event is perfect for those ready to evolve from AI-curious to AI-creators alongside a supportive community led by Monica Abrams, founder of AI Snack Club."
    },
    {
      "title": "Deploy to Reality: A VR Room Experience & Happy Hour (hosted by Baseten & Mixedbread)",
      "date": "Mar5",
      "location": "San Francisco, CA",
      "url": "https://luma.com/3snjfakm?utm_source=cv-events&utm_medium=cerebralvalley",
      "description": "Engineers and AI leaders will dive into an immersive VR experience hosted by Baseten, exploring fast inference and collaborative gameplay while networking over drinks and bites in a casual, tech-forward setting. Baseten, known for its ultra-fast production inference platform, teams up with Mixedbread, a pioneer in large-scale multimodal search, making this a hotspot for innovation and real-world AI expertise."
    },
    {
      "title": "AGI Royale Networking Mixer & Gala (FAANG++ & Ivy/Stanford/UC++)",
      "date": "Mar5",
      "location": "San Francisco, CA",
      "url": "https://www.supermomos.com/events/sf-agi-royale-gala?utm_source=cv-events&utm_medium=cerebralvalley",
      "description": "The AGI Royale Gala by Supermomos will bring together leading AI and tech experts from top companies like Microsoft, OpenAI, and Google for a night filled with AI-inspired music, fashion, and high-level networking among industry innovators and elite alumni."
    },
    {
      "title": "The Future of Engineering Leadership",
      "date": "Mar5",
      "location": "Mountain View, CA",
      "url": "https://luma.com/revelo-t3l-sv-030526?utm_source=cv-events&utm_medium=cerebralvalley",
      "description": "Engineering executives will hear from top CTOs and VPs—including leaders from Zscaler, GoodLeap, Verily, Kinship, and Sierra—on how AI is reshaping team structures, hiring, and leadership roles, followed by networking over food and cocktails."
    },
    {
      "title": "Hype Session: Mountain View - Year of Expansion",
      "date": "Mar5",
      "location": "Mountain View, CA",
      "url": "https://www.eventbrite.com/e/hype-session-mountain-view-tickets-1513968995019?utm_source=cv-events&utm_medium=cerebralvalley",
      "description": "Faith-driven entrepreneurs and founders with a passion for innovation will gather to explore the 2026 theme of \"Year of Expansion,\" blending spiritual growth with startup success in a tech-packed environment. This session promises rich connections for Christian leaders aiming to amplify their impact in business and beyond."
    },
    {
      "title": "Skillathon - The First Agent Skills Hackathon",
      "date": "Mar7",
      "location": "San Francisco, CA",
      "url": "https://luma.com/1khurilu?utm_source=cv-events&utm_medium=cerebralvalley",
      "description": "Skillathon Episode #1 will challenge experts, including PhDs and senior pros, to advance AI agent skills across coding, robotics, healthcare, and more, building on the rigorous SkillsBench framework developed by pioneers like Xiangyi Li and Roey Ben Chaim. This hackathon will spotlight cutting-edge procedural knowledge and iterative learning methods to push AI agents beyond current real-world limitations."
    },
    {
      "title": "Scrappy AI Founders Go Dirt-Biking",
      "date": "Mar7",
      "location": "San Jose, CA",
      "url": "https://luma.com/ilgrnjhz?utm_source=cv-events&utm_medium=cerebralvalley",
      "description": "A tight-knit group of AI founders and investors will spend an overnight weekend mastering dirt biking fundamentals with pro instructors, balancing thrill and focus on forest trails before unwinding with BBQ and poker, all designed to reset minds beyond typical networking. No prior riding experience is needed, and the event is curated to support diversity and beginner riders."
    },
    {
      "title": "Sip N' Hack: OpusClip Hackathon",
      "date": "Mar7",
      "location": "Palo Alto, CA",
      "url": "https://luma.com/7bf6z60j?utm_source=cv-events&utm_medium=cerebralvalley",
      "description": "An exclusive hackathon will bring together top engineers to explore cutting-edge multimodal GenAI technologies, tackling challenges in LLMs, VLMs, AI agents, and automation within a creative, relaxed setting. Hosted by OpusClip, a Series A+ funded AI video tech company trusted by major media brands, this event will spotlight high-caliber talent pushing the boundaries of AI innovation."
    },
    {
      "title": "Daytona Compute Conference",
      "date": "Mar8",
      "location": "San Francisco, CA",
      "url": "https://compute.daytona.io/?utm_source=cv-events&utm_medium=cerebralvalley",
      "description": "Compute will convene 1,500 builders — infrastructure engineers, AI researchers, startup founders, and cloud architects — who will explore the new infrastructure layer for AI, agents, and next‑generation cloud while showcasing deep technical talks, demos, and roadmaps shaping what comes next."
    },
    {
      "title": "Py AI Conference",
      "date": "Mar10",
      "location": "San Francisco, CA",
      "url": "https://luma.com/i3cbt3sz?utm_source=cv-events&utm_medium=cerebralvalley",
      "description": "Py AI will gather 300 engineers, founders, and technical leaders including Python creator Guido van Rossum and other notable framework creators to explore breakthroughs and future trends in AI development. The event features two tracks and exclusive sessions led by influential creators in Python, FastAPI, Pydantic, and Prefect."
    },
    {
      "title": "Build with Intent: Leading Engineering in the AI Era with Eric Schmidt",
      "date": "Mar10",
      "location": "San Francisco, CA",
      "url": "https://luma.com/oaf6etsx?utm_source=cv-events&utm_medium=cerebralvalley",
      "description": "Join a curated group of CTOs, VPs of Engineering, and technical leaders at The Battery in San Francisco for an exclusive afternoon with Eric Schmidt. The conversation will go deep on what's actually working in AI-powered development — the automation wins, the new capabilities reshaping how teams build, and how engineering orgs are measuring real impact beyond vibes. Expect lightning talks from engineering leaders who have driven meaningful transformation, followed by happy hour and genuine peer-to-peer connection. Space is limited and approval is required... see more"
    },
    {
      "title": "Fintech Forward: Strategy, Scale, and Success in a Rapidly Changing Market.",
      "date": "Mar10",
      "location": "San Francisco, CA",
      "url": "https://www.eventbrite.com/e/fintech-forward-strategy-scale-and-success-in-a-rapidly-changing-market-tickets-1981023779452?utm_source=cv-events&utm_medium=cerebralvalley",
      "description": "Senior fintech leaders, founders, and investors will explore how AI is set to transform financial services, focusing on strategy, scaling, and emerging opportunities."
    },
    {
      "title": "NachoTuesday: SaaS & AI Founder + Investor Happy Hour",
      "date": "Mar10",
      "location": "San Francisco, CA",
      "url": "https://luma.com/dq4dmqrj?utm_source=cv-events&utm_medium=cerebralvalley",
      "description": "An exclusive happy hour for Seed-funded and later SaaS/AI founders, C-suites, investors, and tech media will bring together leading industry professionals for genuine networking, sponsored by Chargebee and supported by top-tier legal experts from MoFo."
    },
    {
      "title": "\"Beyond Fear: Quantum Computing & BTC\", VC Keynote + Startup Pitches",
      "date": "Mar11",
      "location": "Palo Alto, CA",
      "url": "https://luma.com/m3umr8r5?utm_source=cv-events&utm_medium=cerebralvalley",
      "description": "Investors, scientists, founders, and seasoned pros will dive into fundraising strategies and cutting-edge tech developments, featuring investor keynotes, live startup pitches with expert feedback, and opportunities for meaningful networking over dinner."
    },
    {
      "title": "AI Agents SF — What's Next for MCP?",
      "date": "Mar11",
      "location": "San Francisco, CA",
      "url": "https://luma.com/uz4fr3qk?utm_source=cv-events&utm_medium=cerebralvalley",
      "description": "The one-year anniversary meetup will spotlight breakthroughs in Agentic AI, featuring Harald Kirschner of Microsoft demoing interactive agents in VS Code and Chetan Conikee unveiling Dex, a game-changing adapter platform that streamlines API connectivity for smarter agent collaboration."
    },
    {
      "title": "Vibe Your SaaS: Startup Pitch Competition + VC/Founder Mixer",
      "date": "Mar11",
      "location": "San Francisco, CA",
      "url": "https://luma.com/4k32sjoj?utm_source=cv-events&utm_medium=cerebralvalley",
      "description": "The exclusive VYS gathering will bring together AI-first founders, top-tier VCs like Ullas Naik and Charles Hudson, and innovative startups pitching to win based on innovation, market potential, and execution. Expect a powerhouse mix of industry-leading investors and forward-thinking founders all focused on building the next generation of transformative SaaS companies."
    },
    {
      "title": "How to Become a Founding Engineer",
      "date": "Mar11",
      "location": "San Francisco, CA",
      "url": "https://luma.com/aic-sf-3-11?utm_source=cv-events&utm_medium=cerebralvalley",
      "description": "Engineers aiming to land founding roles at high-growth AI startups will gain practical insights from Xinchi Qi, former founding engineer turned CTO and cofounder, on what founders seek, key skill gaps, and how to evaluate promising startups for real ownership and influence."
    },
    {
      "title": "UiPath DevConnect 2026: Workshop",
      "date": "Mar12",
      "location": "San Francisco, CA",
      "url": "https://luma.com/DevConnect-SF26?utm_source=cv-events&utm_medium=cerebralvalley",
      "description": "This all-day event will showcase the latest UiPath Platform™ Agentic Automation updates and offer hands-on workshops for building AI-powered agents, ideal for professionals eager to deepen their expertise in enterprise automation alongside experts from UiPath, qBotica, and AI Collective."
    },
    {
      "title": "Evals & AI Agents Meetup: Know Your Agent (Snowflake x Deepchecks)",
      "date": "Mar12",
      "location": "San Francisco, CA",
      "url": "https://luma.com/z2qae6kx?utm_source=cv-events&utm_medium=cerebralvalley",
      "description": "GenAI practitioners and AI engineers will gather for an evening of technical talks and hands-on insights into building and debugging AI agents, featuring the introduction of Know Your Agent (KYA) to enhance autonomous workflow analysis. This meetup will offer food, drinks, and networking with product leaders driving the future of AI agents."
    },
    {
      "title": "Robotic Agents Hackathon",
      "date": "Mar13",
      "location": "San Francisco, CA",
      "url": "https://luma.com/robotic-agents-hackathon?utm_source=cv-events&utm_medium=cerebralvalley",
      "description": "The Robotic Agents Hackathon will gather developers, from beginners to experts, to build AI agents that sense and interact with the physical world using real robotic hardware like robotic arms and rovers, leveraging advanced platforms such as Cyberwave and Toolhouse—all within a high-energy, one-day build and demo challenge."
    },
    {
      "title": "AINative GDC 2026 Hackathon",
      "date": "Mar13",
      "location": "San Francisco, CA",
      "url": "https://luma.com/z81rufyb?utm_source=cv-events&utm_medium=cerebralvalley",
      "description": "The AINative GDC 2026 Hackathon will bring together seasoned developers, designers, and founders to create groundbreaking AI-native games, using generative AI for everything from world-building to gameplay and infrastructure. Participants with expertise in AIKit, AINative APIs, and related tech will prototype and launch innovative games over two intense days."
    },
    {
      "title": "AI Builders Play Pickleball (Browserbase x DigitalOcean)",
      "date": "Mar13",
      "location": "San Francisco, CA",
      "url": "https://luma.com/rfe3f44l?utm_source=cv-events&utm_medium=cerebralvalley",
      "description": "Browserbase and DigitalOcean will host a laid-back evening of drinks and lively chats, perfect for unwinding before Nvidia GTC."
    },
    {
      "title": "the residency - demo day",
      "date": "Mar13",
      "location": "San Francisco, CA",
      "url": "https://luma.com/rt39ip3d?utm_source=cv-events&utm_medium=cerebralvalley",
      "description": "This upcoming demo day will spotlight a global network of elite founders driving $3 billion in startup value, showcasing cutting-edge innovations across deep tech, biotech, and software to investors seeking the next unicorn. Attendees will experience a high-caliber lineup of presentations from founders celebrated for their Silicon Valley expertise and impactful startup ecosystems."
    },
    {
      "title": "No-AI-Hype Developer Security and Optimization Meetup on Sycophancy",
      "date": "Mar13",
      "location": "San Francisco, CA",
      "url": "https://luma.com/9khbgqge?utm_source=cv-events&utm_medium=cerebralvalley",
      "description": "Malihe Alikhani from Northeastern will dive into her paper \"BASIL: Bayesian Assessment of Sycophancy in LLMs,\" tackling real-world AI safety and ethical challenges with a no-nonsense, developer-focused approach."
    },
    {
      "title": "Worlds in Action Hack",
      "date": "Mar14",
      "location": "San Francisco, CA",
      "url": "https://luma.com/worldsinaction-sf26?utm_source=cv-events&utm_medium=cerebralvalley",
      "description": "Worlds in Action Hack will gather XR/game developers, physical AI engineers, and autonomous systems researchers to explore groundbreaking world models—AI that predicts physical interactions in 3D environments—with advanced tools like NVIDIA Isaac and PICO devkits, offering hands-on innovation and mentorship."
    },
    {
      "title": "Taiwan Demo Day 2026 \\| Spring",
      "date": "Mar14",
      "location": "Mountain View, CA",
      "url": "https://luma.com/1xmjyrk2?utm_source=cv-events&utm_medium=cerebralvalley",
      "description": "Taiwan Demo Day on March 14, 2026 will spotlight breakthrough AI startups from early-stage to Series B, featuring live demos and deep dives across agentic AI, robotics, biotech, and more, with founders, accredited investors, and corporate innovators from both Taiwan and Silicon Valley converging for sharp insights and high-impact networking."
    },
    {
      "title": "Mars Colony Program",
      "date": "Mar14",
      "location": "San Francisco, CA",
      "url": "https://luma.com/yjj2oj0p?utm_source=cv-events&utm_medium=cerebralvalley",
      "description": "The MARTIANS First-Wave Settlement Program briefing will bring together engineers, systems thinkers, and NASA-affiliated space researchers to explore the foundations of humanity’s first permanent Mars colony, with top-tier VC leaders from OpenAI and Facebook AI Research guiding the vision. Attendees considered for founding roles will preview life-support systems and long-term colony plans, shaping the future of interplanetary civilization."
    },
    {
      "title": "AI+ Renᴬᴵssance Conference",
      "date": "Mar15",
      "location": "San Francisco, CA",
      "url": "https://luma.com/renaissance26?utm_source=cv-events&utm_medium=cerebralvalley",
      "description": "Renaissance 2026 will gather 40 AI pioneers, including founders, researchers, and engineers, alongside 20+ top startups and 2,000 industry professionals to dive into breakthroughs in Multimodal Intelligence, AI Agents, Infrastructure, and Robotics. This flagship summit spotlights visionaries shaping the future of AI over two intensive days."
    },
    {
      "title": "Secure AI Factory: GTC Happy Hours for AI Executives with Massed Compute, Gruve AI, EOS, & Rapt AI",
      "date": "Mar16",
      "location": "San Jose, CA",
      "url": "https://luma.com/nwzas2ir?utm_source=cv-events&utm_medium=cerebralvalley",
      "description": "AI leaders and infrastructure experts from top companies like Massed Compute, EOS IT Solutions, and Rapt AI will gather to tackle secure, scalable AI model deployment and cutting-edge GPU optimization strategies. This exclusive evening brings together professionals focused on optimizing training, inference, and AI infrastructure for the next generation."
    },
    {
      "title": "NVIDIA GTC 2026 Happy Hour: AI Builders Party",
      "date": "Mar16",
      "location": "San Jose, CA",
      "url": "https://luma.com/975masw4?utm_source=cv-events&utm_medium=cerebralvalley",
      "description": "After a full day at NVIDIA GTC 2026, builders and operators in AI, robotics, and gaming will unwind with a Super Smash Bros challenge, live robot demos, and networking over bites and drinks, all in a relaxed atmosphere hosted by industry leaders like Union.ai, Workato, and Bright Machines."
    },
    {
      "title": "Unprompted: An Exclusive GTC Dinner with Modular & LlamaIndex",
      "date": "Mar16",
      "location": "San Jose, CA",
      "url": "https://luma.com/unprompted?utm_source=cv-events&utm_medium=cerebralvalley",
      "description": "An exclusive dinner will bring together 40 technical leaders and founders specializing in AI infrastructure and research, featuring insights from experts Jerry and Chris on AI agents, document understanding, and the evolving blend of human and machine judgment."
    },
    {
      "title": "Builders Welcome Party",
      "date": "Mar16",
      "location": "San Jose, CA",
      "url": "https://luma.com/gtcsj-builderswelcome?utm_source=cv-events&utm_medium=cerebralvalley",
      "description": "The AI-native community will ignite the start of GTC San Jose with a lively welcome party featuring researchers, engineers, and product leaders, complete with dueling pianos, great food, and dynamic networking opportunities."
    },
    {
      "title": "Slovak Tech Conference",
      "date": "Mar17",
      "location": "San Francisco, CA",
      "url": "https://luma.com/SlovakTech26?utm_source=cv-events&utm_medium=cerebralvalley",
      "description": "The Slovak Tech Conference will bring together top Slovak founders, investors, and tech leaders with Silicon Valley experts for dynamic discussions on AI, investment, and global tech innovation, featuring notable figures like Bob Lesko of Tatra SuperCompute and Meta’s Michal Vasko. The event will spotlight award-winning Slovak startups and offer valuable insights from Y Combinator CEO Matej Novak, creating a high-level networking hub for Slovak-U.S. tech collaboration."
    },
    {
      "title": "Frontier Room: GTC After Dark Cocktail Experience for AI Founders by Massed Compute, ePlus, Yotta Labs & Rapt AI",
      "date": "Mar17",
      "location": "San Jose, CA",
      "url": "https://luma.com/rm5kb9f1?utm_source=cv-events&utm_medium=cerebralvalley",
      "description": "An exclusive evening for AI founders and builders pushing the boundaries of training and inference features premium networking with experts from leading GPU service providers and AI infrastructure innovators delivering cutting-edge compute solutions."
    },
    {
      "title": "AINative BarCamp @ GTC 2026",
      "date": "Mar18",
      "location": "San Jose, CA",
      "url": "https://luma.com/cweimh57?utm_source=cv-events&utm_medium=cerebralvalley",
      "description": "At GTC 2026, Kwanza Hall, former U.S. Congressman and Atlanta City Councilman, will host an informal evening BarCamp focusing on AI-native systems, bridging AI infrastructure with economic and civic leadership in a no-stage, no-panels setting for builders and innovators."
    },
    {
      "title": "Inference Happy Hour for AI Founders & Builders Hosted by Massed Compute, Rapt AI, Amaara, Qwerky AI, & Modular.",
      "date": "Mar18",
      "location": "San Jose, CA",
      "url": "https://luma.com/drfpq7kh?utm_source=cv-events&utm_medium=cerebralvalley",
      "description": "AI founders and builders will explore groundbreaking advancements in inference workload performance, efficiency, and scalability, featuring expert insights from NVIDIA Cloud Partners and innovators optimizing GPU usage and large language model speed."
    },
    {
      "title": "The Human Signal Social",
      "date": "Mar18",
      "location": "San Francisco, CA",
      "url": "https://luma.com/giu8qvyj?utm_source=cv-events&utm_medium=cerebralvalley",
      "description": "Appen’s Human Signal Social will bring together AI researchers, technical leaders, and product teams for a focused evening of deep conversations and networking, enhanced by crafted cocktails and a thoughtfully curated guest list. This gathering promises meaningful interactions among seasoned AI professionals and industry innovators."
    },
    {
      "title": "SF PITCH NIGHT \\#17 (w/ The AI Collective)",
      "date": "Mar18",
      "location": "San Francisco, CA",
      "url": "https://luma.com/sfp?utm_source=cv-events&utm_medium=cerebralvalley",
      "description": "The upcoming SF Pitch Night will spotlight cutting-edge AI and tech innovations with top founders presenting sharp demos of new AI models and agents, promising a high-energy showcase of breakthrough builds."
    },
    {
      "title": "Llama Lounge 24: at Google with Deepmind",
      "date": "Mar19",
      "location": "Mountain View, CA",
      "url": "https://luma.com/llamalounge24?utm_source=cv-events&utm_medium=cerebralvalley",
      "description": "AI leaders including CEOs of AI startups, VCs, and corporate decision-makers will discover cutting-edge innovations from 10 startups pitching live, alongside networking and insights from industry experts like Jeremiah Owyang and Peter Danenberg of Google DeepMind."
    },
    {
      "title": "(un)official BSidesSF Rooftop Afterparty",
      "date": "Mar21",
      "location": "San Francisco, CA",
      "url": "https://luma.com/rooftop-party?utm_source=cv-events&utm_medium=cerebralvalley",
      "description": "Aikido, Chainguard, Sublime, Tailscale, and Torq will host a laid-back rooftop afterparty perfect for cybersecurity professionals attending BSidesSF or RSAC, featuring over 300 peers, open bar, and genuine conversations without any sales pitches."
    },
    {
      "title": "The Zero-Day Dilemma: Securing AI When Your Board Won't Wait, but Your People Won't Ask \\| Presented by Portal26",
      "date": "Mar23",
      "location": "San Francisco, CA",
      "url": "https://luma.com/j02yoksv?utm_source=cv-events&utm_medium=cerebralvalley",
      "description": "Senior technology executives including CISOs, CIOs, and VPs of Security will delve into real-world AI governance and cybersecurity challenges, learning directly from top industry leaders like Portal26's CEO and AWS cybersecurity experts, with a focus on actionable strategies for balancing innovation and risk."
    },
    {
      "title": "7BC Global VC Demo Day",
      "date": "Mar24",
      "location": "San Francisco, CA",
      "url": "https://luma.com/6bc9rlg9?utm_source=cv-events&utm_medium=cerebralvalley",
      "description": "Global VC Demo Day will showcase pitches from 7 merit-selected venture capitalists alongside a fireside chat with Ken Goldman, former CFO of Yahoo! and Fortinet, attracting top-tier institutional and high-net-worth investors in venture capital. The event promises prime networking opportunities with seasoned VCs and Limited Partners, highlighted by leadership from 7BC Capital and distinguished industry figures."
    },
    {
      "title": "ZeroClick Dinner for AI Builders & Operators",
      "date": "Mar24",
      "location": "San Francisco, CA",
      "url": "https://luma.com/zeroclick-sf?utm_source=cv-events&utm_medium=cerebralvalley",
      "description": "Leaders shaping agentic AI, including founders, C-suite executives, and product and growth heads, will explore monetization strategies and developer engagement through ZeroClick’s AI-native ad platform during an intimate evening of insightful conversations and dining."
    },
    {
      "title": "The Agent Toolkit — OpenClaw Hack Day",
      "date": "Mar25",
      "location": "San Francisco, CA",
      "url": "https://luma.com/openclaw-hack-day-mar25-2026?utm_source=cv-events&utm_medium=cerebralvalley",
      "description": "A full-day sprint led by AI and development pros will have developers build and ship real, publishable OpenClaw skills integrating any API, contributing to one of the fastest-growing local AI agent ecosystems with over 160K GitHub stars."
    },
    {
      "title": "AI Healthcare Conference",
      "date": "Mar26",
      "location": "Stanford, CA",
      "url": "https://aihealthcareconference.com/?utm_source=cv-events&utm_medium=cerebralvalley",
      "description": "T.H.I.N.K. 2026 will gather leading clinicians, technologists, and entrepreneurs to explore AI-driven innovations transforming personalized care and population health, aiming to create smarter, more equitable healthcare systems."
    },
    {
      "title": "The 1st OmOCon - oh-my-opencode Show & Tell",
      "date": "Mar28",
      "location": "San Francisco, CA",
      "url": "https://cerebralvalley.ai/e/the-1st-om-o-con-sf-oh-my-opencode-show-and-tell-35df15e0",
      "description": "The inaugural OmOCon SF will gather the Oh My OpenCode community—including 140+ contributors behind the acclaimed open-source AI agent harness—for live demos, deep technical talks, and collaborative Q&A, spotlighting cutting-edge multi-model AI orchestration and real-world workflow innovations."
    },
    {
      "title": "The AI Collective Tri-Valley \\| The Future of Human Connection & AI in Wellness & Hospitality",
      "date": "Mar31",
      "location": "Pleasanton, CA",
      "url": "https://luma.com/aic-tr-3-31?utm_source=cv-events&utm_medium=cerebralvalley",
      "description": "AI Collective's Tri-Valley Chapter will explore the mental health impacts of AI-driven isolation with insights from venture capitalist Kenneth Lo, healthtech founder Pati Brzozowska, and psychiatric nurse practitioner Nana Adabie, moderated by community-building expert Meagan Callahan."
    },
    {
      "title": "Coffee Club \\| Early Stage B2B Tech Founders & Funders",
      "date": "Apr1",
      "location": "San Francisco, CA",
      "url": "https://luma.com/3mmskgot?utm_source=cv-events&utm_medium=cerebralvalley",
      "description": "Early-stage B2B and AI founders and investors, especially from underrepresented groups, will connect in a focused meetup hosted by Forum Ventures and Berkeley SkyDeck, leaders known for their backing of innovative startups and deep industry expertise."
    },
    {
      "title": "Scrappy AI Founders Go Hard Hiking (+ overnight stay)",
      "date": "Apr4",
      "location": "San Francisco, CA",
      "url": "https://luma.com/27fq3ner?utm_source=cv-events&utm_medium=cerebralvalley",
      "description": "A vetted group of 15 AI founders and investors will tackle a challenging hike followed by an overnight stay featuring poker and dinner, blending endurance with networking in a unique setting."
    },
    {
      "title": "HumanX Conference",
      "date": "Apr6",
      "location": "San Francisco, CA",
      "url": "https://www.humanx.co/?utm_source=cv-events&utm_medium=cerebralvalley",
      "description": "Top AI experts will share real-world insights and strategies across dynamic sessions, while tailored networking programs like VentureConnect will facilitate purposeful connections and collaborative labs will help attendees map out actionable next steps."
    },
    {
      "title": "Global Missional AI Summit",
      "date": "Apr7",
      "location": "San Jose, CA",
      "url": "https://missional.ai/?utm_source=cv-events&utm_medium=cerebralvalley",
      "description": "The Missional AI Global Summit will gather top AI researchers, theologians, and ministry leaders to explore how responsible AI can advance the Gospel and empower faith communities with ethical innovation."
    },
    {
      "title": "Iceberg Summit 2026",
      "date": "Apr8",
      "location": "San Francisco, CA",
      "url": "https://cerebralvalley.ai/icebergsummit.org",
      "description": "The second annual Apache Iceberg Summit will offer hands-on workshops and deep technical sessions led by core maintainers and seasoned practitioners, perfect for advancing skills in the world’s most advanced table format."
    },
    {
      "title": "Llama Lounge 25: The AI Startup Event",
      "date": "Apr16",
      "location": "Stanford, CA",
      "url": "https://luma.com/llamalounge25?utm_source=cv-events&utm_medium=cerebralvalley",
      "description": "Jeremiah Owyang from Blitzscaling Ventures will host an event featuring demos from ten AI startups, offering a prime opportunity for networking and engaging with cutting-edge tech, backed by sponsors Burton Algorithms and Breakthrough Ventures. Attendees will be industry professionals eager to explore innovative AI solutions in a secure, exclusive setting."
    },
    {
      "title": "Platform Engineering & AI",
      "date": "Apr16",
      "location": "Mountain View, CA",
      "url": "https://luma.com/intuitossmtvapr2026?utm_source=cv-events&utm_medium=cerebralvalley",
      "description": "The event will showcase cutting-edge AI, platform engineering, and open-source innovations with expert speakers from HuggingFace and Intuit leading live demos on diffusion models and async AI agents, drawing in professional engineers and builders eager to explore real-world applications and network with fellow open-source contributors."
    },
    {
      "title": "Pairs By The Bay",
      "date": "Apr17",
      "location": "San Francisco, CA",
      "url": "https://pairs.bythebay.io/?utm_source=cv-events&utm_medium=cerebralvalley",
      "description": "Pairs By the Bay in April 2025 will spotlight AI innovations through vendor-customer duos from top startups and Fortune 500 firms, revealing real-world implementation of compliant, production-grade AI solutions. This conference will attract enterprise engineers, AI researchers, and product leaders eager to explore practical, collaborative AI stacks and industry challenges."
    },
    {
      "title": "Vibe Coding Camp : Build Fast. Ship Faster. Learn the Entire AI Dev Stack.",
      "date": "Apr17",
      "location": "San Francisco, CA",
      "url": "https://luma.com/9fj9m89z?utm_source=cv-events&utm_medium=cerebralvalley",
      "description": "Vibe Coding Camp will bring together developers, founders, indie hackers, designers, and AI-curious builders for a dynamic, hands-on session focused on mastering AI-native workflows through rapid pair programming and real-time architecture thinking. Participants will dive into the full AI Builder ecosystem, learning to build and iterate quickly with cutting-edge coding environments."
    },
    {
      "title": "Domain2Demo Hackathon",
      "date": "Apr25",
      "location": "San Francisco, CA",
      "url": "https://luma.com/algl8oln?utm_source=cv-events&utm_medium=cerebralvalley",
      "description": "Domain2Demo will bring together developers, AI experts, and digital real estate investors for a dynamic hackathon and summit where teams draft premium domains to build AI-driven products, enjoy workshops on Web3 and digital assets, and compete for cash prizes, all supported by top industry mentors and exclusive tech partners."
    },
    {
      "title": "Air Street AI meetup",
      "date": "Apr28",
      "location": "San Francisco, CA",
      "url": "https://luma.com/sfoai?utm_source=cv-events&utm_medium=cerebralvalley",
      "description": "The Air Street SF AI meetup will bring together leaders like Nathan Benaich, author of the 2025 State of AI Report, and Sholto Douglas from Anthropic, featuring insights into cutting-edge AI research, product development, and entrepreneurship, followed by happy hour networking."
    },
    {
      "title": "Coffee Club \\| Early Stage B2B Tech Founders & Funders",
      "date": "May6",
      "location": "San Francisco, CA",
      "url": "https://luma.com/0qwiv0jr?utm_source=cv-events&utm_medium=cerebralvalley",
      "description": "Early-stage B2B and AI founders, especially from underrepresented groups, will gather with seasoned investors from Forum Ventures for a casual meetup aimed at sparking meaningful connections and support in the startup ecosystem."
    },
    {
      "title": "AI Startup School",
      "date": "Jun16",
      "location": "San Francisco, CA",
      "url": "https://events.ycombinator.com/ai-sus?utm_source=cv-events&utm_medium=cerebralvalley",
      "description": "YC’s first-ever AI Startup School will bring together 2,500 elite CS undergrads, masters, and PhD candidates in AI to hear from industry titans like Elon Musk, Satya Nadella, Sam Altman, Andrew Ng, and Fei-Fei Li. This hand-picked gathering promises cutting-edge insights for technically skilled students and researchers in AI, ML, and related fields."
    },
    {
      "title": "The AI Native Speakeasy - AI Engineering Worlds Fair",
      "date": "Jul1",
      "location": "San Francisco, CA",
      "url": "https://luma.com/1xm9eqft?utm_source=cv-events&utm_medium=cerebralvalley",
      "description": "The AI Speakeasy will bring together AI startup founders, engineers, researchers, and select VCs in a laid-back, private lounge for genuine, in-depth conversations beyond the typical conference scene. This exclusive gathering will foster meaningful connections among professionals building and operating real AI systems."
    },
    {
      "title": "Showerhacks",
      "date": "Oct3",
      "location": "San Francisco, CA",
      "url": "https://showerhacks.org/?utm_source=cv-events&utm_medium=cerebralvalley",
      "description": "Showerhacks will showcase engineers pushing boundaries with provocative AI projects, from unconventional chatbots to bold applications in health, law, and dating, judged solely on their edge and originality."
    },
    {
      "title": "Sign In",
      "date": "Oct3",
      "location": "",
      "url": "https://cerebralvalley.ai/auth/login",
      "description": ""
    }
  ]
}